-- Запросы к таблице doctors:

-- 1. Вывести средний оклад (salary) всех сотрудников

select round(avg(salary),2) as `средний оклад`
 from doctors;
 
-- +---------------+
-- | средний оклад |
-- +---------------+
-- |      72767.67 |
-- +---------------+
-- 1 row in set (0.0006 sec)
 
-- 2. Вывести среднюю премию для всех сотрудников, чей доход выше среднего (взять явное значение из результата предыдущего запроса)

select round(avg(premium),2) as `средняя премия`
 from doctors
where salary > 72767.67;

-- +----------------+
-- | средняя премия |
-- +----------------+
-- |       21681.38 |
-- +----------------+
-- 1 row in set (0.0007 sec)

select round(avg(premium),2) as `средняя премия`
 from doctors
where salary > (
	select avg(salary)
	from doctors
);

-- +----------------+
-- | средняя премия |
-- +----------------+
-- |       21681.38 |
-- +----------------+
-- 1 row in set (0.0014 sec)


-- Запросы к таблице vacations:

-- 3. Вывести с сортировкой по возрастанию среднее количество дней в отпуске для каждого сотрудника — используйте функцию datediff()

 select concat_ws(' ', last_name, first_name, patr_name) as `ФИО`, 
       avg(datediff(end_date, start_date)) as `Среднеe количество дней в отпуске`
  from vacations as v
  join doctors as d
   on d.id = v.doctors_id
 group by doctors_id
 order by `Среднеe количество дней в отпуске`;


--   ----------------------------------+-----------------------------------+
-- | ФИО                               | Среднеe количество дней в отпуске |
-- +-----------------------------------+-----------------------------------+
-- | Андреев Арсений Данилович         |                         1796.2222 |
-- | Васильева Вероника Артёмовна      |                         1884.1333 |
-- | Кузнецова Вероника Ярославовна    |                         2158.8000 |

-- |
-- | Леонова Татьяна Александровна     |                         3870.0000 |
-- | Яковлев Иван Константинович       |                         4893.7500 |
-- +-----------------------------------+-----------------------------------+
-- 70 rows in set (0.0077 sec)



-- 4. Вывести для каждого сотрудника самый ранний год отпуска и самый поздний год отпуска с сортировкой по возрастанию разности между этими двумя значениями

select concat_ws(' ', last_name, first_name, patr_name) as `ФИО`, 
	min(year(start_date)) as `ранний год`,
	max(year(start_date)) as `поздний год`
  from vacations as v
  join doctors as d
   on d.id = v.doctors_id
group by doctors_id
order by `поздний год` - `ранний год`;

-- +-----------------------------------+------------+-------------+
-- | ФИО                            | ранний год | поздний год |
-- +-----------------------------------+------------+-------------+
-- | Яковлев Иван Константинович       |       2001 |        2007 |
-- | Михайлова Александра Даниэльевна  |       2001 |        2010 |
-- | Миронов Никита Матвеевич          |       2001 |        2013 |
-- | Максимова Алиса Данииловна        |       2002 |        2014 |

-- | Волкова Ева Егоровна              |       2000 |        2023 |
-- +-----------------------------------+------------+-------------+
-- 70 rows in set (0.0066 sec)
 
 
 -- Запросы к таблице donations:
 -- 5. Вывести сумму пожертвований за всё время для каждого отделения с сортировкой по возрастанию номеров отделений
 
select departments_id,  sum(amount)  as `сумма`
 from donations
group by departments_id
order by departments_id;
 
-- +----------------+-------------+
-- | departments_id | сумма       |
-- +----------------+-------------+
-- |              1 |  3906387.00 |
-- |              2 | 14824812.00 |
-- |              3 |  5329716.00 |
-- |              4 | 17541590.00 |
-- |              5 | 18834643.00 |
-- |              6 |  8932248.00 |
-- |              7 |  3288830.00 |
-- +----------------+-------------+

-- 6. Вывести сумму пожертвований за каждый год для каждого спонсора с сортировкой по возрастанию номеров спонсоров и годов
select sponsors_id, 
	year(date) as `год`, 
	sum(amount)  as `сумма`
 from donations    
group by sponsors_id, `год` 
order by sponsors_id, `год`;

-- +-------------+------+------------+
-- | sponsors_id | год | сумма |
-- +-------------+------+------------+
-- |           1 | 2008 | 2031320.00 |
-- |           2 | 2004 |  245080.00 |
-- |           2 | 2005 | 1629290.00 |
-- |           2 | 2007 | 1580363.00 |
-- |           2 | 2009 | 2531422.00 |
-- |           2 | 2016 | 1843308.00 |
-- |           2 | 2018 |  947229.00 |
-- |           2 | 2022 | 1856049.00 |
-- |           3 | 2003 |  803356.00 |
-- |           3 | 2007 |  685092.00 |
-- |           3 | 2018 |  388077.00 |
-- |           3 | 2023 | 1938799.00 |
-- |           4 | 2011 |  361385.00 |
-- |           4 | 2012 | 2941727.00 |
-- |           4 | 2013 |  930587.00 |
-- +-------------+------+------------+

-- |          11 | 2019 |  480300.00 |
-- |          11 | 2021 |  582378.00 |
-- |          12 | 2002 |  772941.00 |
-- |          12 | 2006 |  277402.00 |
-- |          12 | 2012 | 1736411.00 |
-- |          12 | 2018 |  127413.00 |
-- |          12 | 2021 | 1870133.00 |
-- +-------------+------+------------+
-- 62 rows in set (0.0008 sec)
